{ 
 "blogs":[
    {
        "id": 3,
        "title": "Rise of Pornography on X",
        "image": "/public/x.jpg",
        "category": "Research",
        "author": "Kshitij Bajpai",
        "authorPic": "author1.jpg",
        "published_date": "October 4, 2023",
        "reading_time": "8 minutes",
        "content": "X (formerly known as Twitter) is arguably the most interesting social media platform on the Internet. It stands witness to the greatest of pranks and the greatest of meltdowns. What has been added is not exactly the most favored trait: how it is now full of pornography. You could be scrolling on X, find a good thread discussing God knows what, and just when the post ends and the comments start, find a horde of people who are ‘interested to talk to you’ with their semi-nude pictures and rather spammy accounts. It’s not that Twitter never hosted such NSFW content; it all went uphill when Elon Musk acquired the company in 2022. [Musk] acquired Twitter at a time when the digital ad market was in a slump due to the economic slowdown, said Jasmine Enberg, a principal analyst covering social media and the creator economy at Emarketer, adding that in times of economic uncertainty, companies cut back on brand advertising and also spending on platforms that are deemed less essential. And Twitter checked both of those boxes. Under Musk’s ownership, Twitter saw major layoffs in the content moderation sector and the dissolution of the Trust and Safety Council. Twitter has always had a bot problem, and these decisions certainly were not helping the users or even the company itself. Now, in a desperate-looking attempt to reach their revenue targets, X has been allowing anyone to have a profile boost and the ads are weirder and more irrelevant than ever. I myself have seen this as my X is mostly motorsports with politics but come face to face with ads that are talking about a political party’s manifesto and other pre-election promises. For years now, users and tech reporters have observed what they say is the real-time decay of websites, social media platforms, and search engines. Put simply, the internet sucks more now. Cory Doctorow, a tech journalist and science fiction writer, coined the term 'enshittification' as a way to describe how many of the places we populate online have been getting worse and how users aren't given many alternatives. It started off as experts inviting users to Facebook from MySpace and then to Instagram and Twitter and whatnot. Progressively, social media platforms go haywire and retrograde just for new platforms to replace them that in turn suffer the same fate. Max Chafkin, a senior reporter for Bloomberg Businessweek, wrote a piece about how the next big app might be just nothing, saying that social media companies gambled on the idea of endless growth and the idea that people would always be comfortable with spending a third of their days racking up screen time. 'The more time people spend on [social media], the more money the companies make. And so as a result, they're all maximizing for engagement. So this leads to a cultural problem, and then there's maybe a business problem,' he said. But this does not end here. X is reportedly testing NSFW communities where creators can have a more direct interaction with their audience and probably even monetize the same. Do note that though X allows NSFW content to be posted, the creators cannot monetize it and hence mostly use their X profiles to promote their streaming accounts like OnlyFans. If X were able to make Communities a successful product, it could potentially serve as a competitor to larger forum sites like Reddit and host training data for Musk’s AI-run chatbot Grok, which has exclusive access to adult content. Though this might be a dream come true for X owner Elon Musk, it will definitely be a nightmare to countless X users who do not like to have half-naked people stalking their ‘For You’ page. Given the current situation, where X itself is not batting an eye over its increasing population of not-safe-for-work bots, users are bound to either have their brains shut off expecting to come across anything unpleasant or simply leave the premises altogether.",
        "tags": [
          "Health"
        ]
      },
      
      {
        "id": 4,
        "title": "What is the future of Computer Architecture",
        "image": "/public/computer architecture.jpg",
        "category": "Research",
        "author": "Rashi Bajpai",
        "authorPic": "author1.jpg",
        "published_date": "October 4, 2023",
        "reading_time": "8 minutes",
        "tags": ["Health"],
        "content": "Since generations we have been using John von Neumann's Computer Architecture also known as Princeton Architecture proposed in 1945 which pointed out the five components of a computer system: Controller, Arithmetic unit, Memory, Input, Output. Simply put, a computer must have memory. Since then, enhancements have been made in terms of RAM, ROM, graphics, SSD, and more.\n\n But what if we say that the next generation of computers will replace this architecture? You read it correctly. Harvard Architecture, as the name suggests, was designed and invented at Harvard for the Mark 1 computer. It is a computer architecture with separate storage and signal pathways for instructions and data.\n\nThe strict separation of code and processes in Harvard Architecture contrasts with a modified Harvard Architecture, which may combine some features of data and code while preserving separation in others.\n\n What is the stored program concept? It refers to storing instructions and data simultaneously, as followed by Von Neumann's architecture. Harvard used a relay-based computer model.\n\nDoes the Harvard Architecture have the von Neumann bottleneck? The shared bus between the program memory leads to the von Neumann bottleneck, which is the limited throughput between the central processing unit. The bottleneck is how fast you can fetch data from memory. Whether you can fetch instructions at the same time doesn't seem to matter. We have to wait until the data arrives. Fetching data might take 100 CPU cycles and executing instructions takes 1 cycle.\n\nThe ability to do that extra cycle isn't a great improvement. Harvard Architecture mitigates this bottleneck by separating instruction and data memories. Backus talks about looking at the actual traffic on this bus. Ironically, a large part of traffic is not useful data but merely names of data, consisting of names as well as operations and data used only to compute such names. In a Harvard Architecture with a separated I/D bus, that will not change.\n\nWhat is the difference between these two architectures? In Von Neumann's architecture, there is a common bus for data and instruction transfer, while Harvard has separate buses for transferring data and instructions. Von Neumann's architecture is used in personal and small computers, and Harvard is used in microcontrollers and signal processing.\n\nComparison: When compared with traditional architecture, the new computer architecture based on dual-space memory integrates internal and external memory. The biggest advantage of this new structure is that it eliminates the need to copy data between internal and external storage, speeding up the system.\n\nRole of Memory in Harvard Architecture: Memory plays a crucial role in Harvard Architecture systems, and programmers must optimize the use of different types of memory to improve system performance. The separate memory modules for data and instruction memory mean that the architecture can work with significant amounts of both types of memory, resulting in efficient and effective use of resources.\n\nAdvantage: One of the advantages of Harvard Architecture systems is that they can access both data and instruction memory simultaneously, which allows for faster processing times. This is because the separate memory modules allow for parallel processing, which can significantly improve system performance.\n\nHarvard Architecture improves the speed of processor operation because data and addresses do not have to share the same bus lines. The reduced size of the instruction set also speeds up decoding, and the short data path length in a single chip design reduces data transmission time. The program execution hardware uses a ‘pipeline’ arrangement, where one instruction is executed while the next is being fetched from program memory.\n\nThis overlapping of instruction processing can double the overall execution rate. All these features contribute to a high speed of operation compared to traditional microprocessors that use a conventional Von Neumann architecture, where the program and data share the same data bus and memory space.\n\nConclusion: HARVARD ARCHITECTURE represents the next generation in computer architecture with its phenomenal enhancements and totally new design. Not just in display, memory, and graphics but a completely new architecture. And that’s HARVARD ARCHITECTURE."
      },
      
      
    {
        "id": 5,
        "title": "Youtube VS Ad-blockers",
        "image": "/public/yt.jpg",
        "category": "Research",
        "author": "Pranita Kute",
        "authorPic": "author1.jpg",
        "published_date": "October 4, 2023",
        "reading_time": "8 minutes",
        "content": "When individuals choose to utilise ad-blocking applications provided by external sources in order to stream videos, they may encounter issues such as extended periods of buffering or receiving error notifications due to YouTube's implementation of restrictions on ad blockers specifically on portable devices. YouTube has recently implemented more robust strategies to combat the utilisation of ad-blocking tools, focusing on individuals who view videos via third-party applications that bypass advertisements on their mobile devices. Those who opt for these applications may experience delays in video loading or receive notifications indicating that the desired content cannot be accessed through the respective app. Last year, YouTube launched a global initiative with the intention of politely requesting users to either view advertisements or contemplate the option of upgrading to YouTube Premium, which offers an ad-free experience and additional features. In addition to this, they implemented measures to restrict access to videos for individuals who have enabled ad blocking extensions, aiming to uphold the sustainability of the platform's content creators and the overall user experience. “We only allow third-party apps to use our API when they follow our API Services Terms of Service,” YouTube says. “When we find an app that violates these terms, we will take appropriate action to protect our platform, creators, and viewers.” YouTube graciously requests that third-party applications adhere diligently to the Terms of Service when utilising its Application Programming Interface (API). In order to enhance user satisfaction and optimise their viewing experience, YouTube strongly recommends exploring the benefits of subscribing to YouTube Premium, an exclusive service that offers an ad-free environment for uninterrupted content consumption. The decision to take action was ultimately reached by YouTube subsequent to observing a reduction in advertising revenues amounting to 2.6 percent, equating to $6.69 billion in the first quarter of 2023, marking the third successive quarterly decrease in this metric. This occurrence coincided with a period characterised by a global deceleration in advertising activities, primarily attributable to the prevailing economic uncertainties. In the month of February in the year 2024, YouTube made a significant announcement stating that the platform has garnered a total of more than 100 million paying subscribers encompassing both YouTube Premium and YouTube Music, marking a notable increase from the previous count of 80 million subscribers recorded back in November of 2022. During the month of January, Sundar Pichai, the Chief Executive Officer, the parent company of Google, disclosed that the entirety of Google's subscription-based operations, including the popular services such as YouTube Premium, had achieved a remarkable milestone by surpassing $15 billion in revenue generated annually.",
        "tags": [
            "Health"
        ]
    }
]
}