{ 
 "blogs":[
    {
        "id": 3,
        "title": "Rise of Pornography on X",
        "image": "/x.jpg",
        "category": "Research",
        "author": "Kshitij Bajpai",
        "authorPic": "author1.jpg",
        "published_date": "May 13, 2024",
        "reading_time": "5 minutes",
        "content1" : "X (formerly known as Twitter) is arguably the most interesting social media platform on the Internet. It stands witness to the greatest of pranks and the greatest of meltdowns. What has been added is not exactly the most favored trait: how it is now full of pornography. You could be scrolling on X, find a good thread discussing God knows what, and just when the post ends and the comments start, find a horde of people who are ‘interested to talk to you’ with their semi-nude pictures and rather spammy accounts. It’s not that Twitter never hosted such NSFW content; it all went uphill when Elon Musk acquired the company in 2022. ",
        "content2" :"[Musk] acquired Twitter at a time when the digital ad market was in a slump due to the economic slowdown, said Jasmine Enberg, a principal analyst covering social media and the creator economy at Emarketer, adding that in times of economic uncertainty, companies cut back on brand advertising and also spending on platforms that are deemed less essential. And Twitter checked both of those boxes. Under Musk’s ownership, Twitter saw major layoffs in the content moderation sector and the dissolution of the Trust and Safety Council. Twitter has always had a bot problem, and these decisions certainly were not helping the users or even the company itself. ",
        "content3" :"Now, in a desperate-looking attempt to reach their revenue targets, X has been allowing anyone to have a profile boost and the ads are weirder and more irrelevant than ever. I myself have seen this as my X is mostly motorsports with politics but come face to face with ads that are talking about a political party’s manifesto and other pre-election promises. For years now, users and tech reporters have observed what they say is the real-time decay of websites, social media platforms, and search engines. Put simply, the internet sucks more now. Cory Doctorow, a tech journalist and science fiction writer, coined the term 'enshittification' as a way to describe how many of the places we populate online have been getting worse and how users aren't given many alternatives. ",
        "content4" : "It started off as experts inviting users to Facebook from MySpace and then to Instagram and Twitter and whatnot. Progressively, social media platforms go haywire and retrograde just for new platforms to replace them that in turn suffer the same fate. Max Chafkin, a senior reporter for Bloomberg Businessweek, wrote a piece about how the next big app might be just nothing, saying that social media companies gambled on the idea of endless growth and the idea that people would always be comfortable with spending a third of their days racking up screen time. 'The more time people spend on [social media], the more money the companies make. And so as a result, they're all maximizing for engagement. So this leads to a cultural problem, and then there's maybe a business problem,' he said. But this does not end here. X is reportedly testing NSFW communities where creators can have a more direct interaction with their audience and probably even monetize the same.",
        "content5" : "Do note that though X allows NSFW content to be posted, the creators cannot monetize it and hence mostly use their X profiles to promote their streaming accounts like OnlyFans. If X were able to make Communities a successful product, it could potentially serve as a competitor to larger forum sites like Reddit and host training data for Musk’s AI-run chatbot Grok, which has exclusive access to adult content. Though this might be a dream come true for X owner Elon Musk, it will definitely be a nightmare to countless X users who do not like to have half-naked people stalking their ‘For You’ page. Given the current situation, where X itself is not batting an eye over its increasing population of not-safe-for-work bots, users are bound to either have their brains shut off expecting to come across anything unpleasant or simply leave the premises altogether.",
        "tags": [
          "Health"
        ]
      },
      
      {
        "id": 4,
        "title": "What is the future of Computer Architecture",
        "image": "/computer architecture.jpg",
        "category": "Research",
        "author": "Rashi Bajpai",
        "authorPic": "author1.jpg",
        "published_date": "June 2, 2024",
        "reading_time": "8 minutes",
        "tags": ["Health"],
        "content1" : "Since generations we have been using John von Neumann's Computer Architecture also known as Princeton Architecture proposed in 1945 which pointed out the five components of a computer system: Controller, Arithmetic unit, Memory, Input, Output. Simply put, a computer must have memory. Since then, enhancements have been made in terms of RAM, ROM, graphics, SSD, and more. But what if we say that the next generation of computers will replace this architecture? You read it correctly. Harvard Architecture, as the name suggests, was designed and invented at Harvard for the Mark 1 computer. It is a computer architecture with separate storage and signal pathways for instructions and data.",
        "content2" :"The strict separation of code and processes in Harvard Architecture contrasts with a modified Harvard Architecture, which may combine some features of data and code while preserving separation in others. What is the stored program concept? It refers to storing instructions and data simultaneously, as followed by Von Neumann's architecture. Harvard used a relay-based computer model. Does the Harvard Architecture have the von Neumann bottleneck? The shared bus between the program memory leads to the von Neumann bottleneck, which is the limited throughput between the central processing unit.",
        "content3" :"The bottleneck is how fast you can fetch data from memory. Whether you can fetch instructions at the same time doesn't seem to matter. We have to wait until the data arrives. Fetching data might take 100 CPU cycles and executing instructions takes 1 cycle.The ability to do that extra cycle isn't a great improvement. Harvard Architecture mitigates this bottleneck by separating instruction and data memories. Backus talks about looking at the actual traffic on this bus. Ironically, a large part of traffic is not useful data but merely names of data, consisting of names as well as operations and data used only to compute such names.",
        "content4" : "In a Harvard Architecture with a separated I/D bus, that will not change. What is the difference between these two architectures? In Von Neumann's architecture, there is a common bus for data and instruction transfer, while Harvard has separate buses for transferring data and instructions. Von Neumann's architecture is used in personal and small computers, and Harvard is used in microcontrollers and signal processing. ",
        "content5" : "Comparison: When compared with traditional architecture, the new computer architecture based on dual-space memory integrates internal and external memory. The biggest advantage of this new structure is that it eliminates the need to copy data between internal and external storage, speeding up the system.",
        "content6" : "Role of Memory in Harvard Architecture: Memory plays a crucial role in Harvard Architecture systems, and programmers must optimize the use of different types of memory to improve system performance. The separate memory modules for data and instruction memory mean that the architecture can work with significant amounts of both types of memory, resulting in efficient and effective use of resources. ",
        "content7": "Advantage: One of the advantages of Harvard Architecture systems is that they can access both data and instruction memory simultaneously, which allows for faster processing times. This is because the separate memory modules allow for parallel processing, which can significantly improve system performance. Harvard Architecture improves the speed of processor operation because data and addresses do not have to share the same bus lines. The reduced size of the instruction set also speeds up decoding, and the short data path length in a single chip design reduces data transmission time. The program execution hardware uses a ‘pipeline’ arrangement, where one instruction is executed while the next is being fetched from program memory.",
        "content8" : "This overlapping of instruction processing can double the overall execution rate. All these features contribute to a high speed of operation compared to traditional microprocessors that use a conventional Von Neumann architecture, where the program and data share the same data bus and memory space. Conclusion: HARVARD ARCHITECTURE represents the next generation in computer architecture with its phenomenal enhancements and totally new design. Not just in display, memory, and graphics but a completely new architecture. And that’s HARVARD ARCHITECTURE."
        
      },
      
      
    {
        "id": 5,
        "title": "Youtube VS Ad-blockers",
        "image": "/yt.jpg",
        "category": "Research",
        "author": "Pranita Kute",
        "authorPic": "author1.jpg",
        "published_date": "June 30, 2024",
        "reading_time": "5 minutes",
        "content1" : "When individuals choose to utilise ad-blocking applications provided by external sources in order to stream videos, they may encounter issues such as extended periods of buffering or receiving error notifications due to YouTube's implementation of restrictions on ad blockers specifically on portable devices. YouTube has recently implemented more robust strategies to combat the utilisation of ad-blocking tools, focusing on individuals who view videos via third-party applications that bypass advertisements on their mobile devices. ",
        "content2" :"Those who opt for these applications may experience delays in video loading or receive notifications indicating that the desired content cannot be accessed through the respective app. Last year, YouTube launched a global initiative with the intention of politely requesting users to either view advertisements or contemplate the option of upgrading to YouTube Premium, which offers an ad-free experience and additional features. In addition to this, they implemented measures to restrict access to videos for individuals who have enabled ad blocking extensions, aiming to uphold the sustainability of the platform's content creators and the overall user experience. “We only allow third-party apps to use our API when they follow our API Services Terms of Service,” YouTube says.  ",
        "content3" :"“When we find an app that violates these terms, we will take appropriate action to protect our platform, creators, and viewers.” YouTube graciously requests that third-party applications adhere diligently to the Terms of Service when utilising its Application Programming Interface (API). In order to enhance user satisfaction and optimise their viewing experience, YouTube strongly recommends exploring the benefits of subscribing to YouTube Premium, an exclusive service that offers an ad-free environment for uninterrupted content consumption.",
        "content4" : " The decision to take action was ultimately reached by YouTube subsequent to observing a reduction in advertising revenues amounting to 2.6 percent, equating to $6.69 billion in the first quarter of 2023, marking the third successive quarterly decrease in this metric. This occurrence coincided with a period characterised by a global deceleration in advertising activities, primarily attributable to the prevailing economic uncertainties. In the month of February in the year 2024, YouTube made a significant announcement stating that the platform has garnered a total of more than 100 million paying subscribers encompassing both YouTube Premium and YouTube Music, marking a notable increase from the previous count of 80 million subscribers recorded back in November of 2022.",
        "content5": " During the month of January, Sundar Pichai, the Chief Executive Officer, the parent company of Google, disclosed that the entirety of Google's subscription-based operations, including the popular services such as YouTube Premium, had achieved a remarkable milestone by surpassing $15 billion in revenue generated annually.",
        
        "tags": [
            "Health"
        ]
    },
    {
        "id": 6,
        "title": "The role of AI in combating Deep Fakes",
        "image": "/HOW.jpg",
        "category": "Technology",
        "author": "Pranita Kute",
        "authorPic": "author1.jpg",
        "published_date": "August 31, 2024",
        "reading_time": "8 minutes",
        "content1" : "Deepfakes, which are essentially media content generated through the sophisticated capabilities of artificial intelligence technologies and are predominantly designed with the intention to mislead and deceive audiences, represent a particularly critical and rapidly expanding tool utilised for the purposes of spreading misinformation and facilitating digital impersonation. Deepfakes, which can be described as a captivating form of media that includes not only videos but also audio recordings and images, appear to be strikingly authentic and real; however, they have undergone significant alterations through the innovative use of artificial intelligence technology that makes them so convincing. These cleverly manipulated media forms have, unfortunately, been employed in various attempts to influence the outcomes of elections, and they have also been used to create explicit content without the consent of the individuals involved, raising serious concerns about personal privacy and consent. Additionally, this phenomenon brings to light important ethical questions that are intricately tied to issues of surveillance and the need for transparency in our digital age. In a world that is unfortunately filled with misinformation and a growing sense of distrust, the advancements in AI technology provide ever-more sophisticated methods that can convincingly mislead people into believing false information, which has the potential to escalate tensions in the political arena, incite violence, or even lead to the horrors of war.  ",
        "content2" :". In the year 2019, a remarkably sophisticated deepfake video featuring the Belgian politician Koen Geens unexpectedly gained widespread attention and rapidly went viral across various social media platforms. This particular video, which was crafted by a political party with a specific agenda, depicted Geens as if he were delivering a speech in which he allegedly expressed support for the controversial notion of climate change denial, thereby misrepresenting his actual views. The primary objective of this deeply misleading deepfake was to tarnish Geens' reputation significantly and manipulate public perception regarding crucial environmental policies that are vital for the future of our planet. This case study illustrates the wide-ranging implications of deepfake-driven false narratives. Artificial intelligence has wonderfully opened up a world of possibilities that has led to the fascinating creation of synthetic content and deep fakes, which, while intriguing, also introduce a considerable and urgent challenge that spans across numerous areas of our daily lives and societal interactions. ",
        "content3" :"The repercussions of this alarming threat are extensive and far-reaching, affecting not only the way we interact within our communities and uphold societal norms, but also crucial aspects that include our national security, the frameworks that guide our legal systems, and the intricate workings of our financial infrastructures. They are produced through the intricate processes of machine-learning algorithms that are seamlessly integrated with advanced facial-mapping software, allowing for the insertion of this data into various forms of digital content, often executed without the necessary permission from the individuals involved.  When the deployment of these deepfake technologies is executed with remarkable accuracy and expertise, the resulting output can seem exceptionally persuasive, despite being entirely contrived, encompassing a variety of textual, visual, or auditory materials that portray an individual undertaking actions or articulating remarks that they have never genuinely executed or expressed. ",
        "content4" : "Deepfakes possess the potential to exert deeply profound psychological effects on individuals in ways that may not always be immediately apparent or understood. When individuals come across deep fakes that specifically target either their personal identities or the identities of their communities as a whole, it can lead to a multitude of negative feelings including confusion, anxiety, and a pervasive sense of distrust that can linger long after the encounter. The emotional repercussions stemming from the experience of convincing deepfakes can drastically shape individuals perceptions and beliefs about reality, thereby perpetuating the widespread dissemination of misinformation that can have far-reaching consequences. ",
        "content5": "In order to successfully tackle and lessen the risks that arise from the current climate of deep fake dissemination and its rapid spread, it is absolutely essential for us to gain a thorough and nuanced understanding of the various individuals and organisations involved in perpetuating this concerning issue, the innocent individuals who unwittingly become victims of its harmful impacts, and the sophisticated technology that allows for its creation and widespread distribution. The detection of deepfake content has proven to be an exceedingly complex and daunting challenge, primarily attributable to the rapid advancements in the sophistication of deepfake algorithms being devised and the impressive capability of these technologies to create remarkably lifelike and misleadingly persuasive media that can easily deceive observers. ",
        "content6" : "In order to effectively counteract the rampant spread of misinformation and disinformation that arises from deepfakes, it is of utmost importance to develop sophisticated detection techniques, enhance media literacy among the public, raise awareness regarding both the existence and the far-reaching implications of deep fakes, and implement comprehensive policies that ensure creators and distributors of harmful deepfakes are held accountable for their actions. By tackling the fundamental issues at play and gaining a deeper understanding of the mechanisms through which deepfakes facilitate the spread of misinformation, we can strive to mitigate their negative impact while fostering a society that is more informed, resilient, and better equipped to navigate the complexities of modern information. Investigating various case studies and examples that highlight deepfake-driven false narratives helps illuminate the tangible real-world effects and the broader implications that this technology can have on society and individual lives alike.",
        "content7": "Currently, researchers are diligently working on developing innovative techniques aimed specifically at identifying deepfakes, which includes the exciting creation of advanced AI models that are designed to detect subtle discrepancies in colours and other visual elements found within videos or images. Furthermore, a variety of authentication strategies, such as the ingenious incorporation of digital watermarks, operate as effective mechanisms that can validate the authenticity of a video or image by providing clear evidence of any modifications that may have been made, thereby helping to ensure trust in our digital content. AI occupies an absolutely crucial and indispensable position in the intricate domain of both the creation and identification of deep fake content, which is an elaborate process that fundamentally hinges on the innovative advancement of extraordinarily lifelike synthetic videos or images by effectively leveraging sophisticated artificial intelligence methodologies and techniques. The intricate fabrication of such deepfake materials relies significantly on the strategic utilisation of AI-driven tools and algorithms that are exceptionally adept at producing convincingly realistic fake videos by seamlessly altering and replacing facial features or fine-tuning various audio components to achieve a high degree of authenticity.",
                
        "tags": [
            "tech"
        ]     
    },
    {
      "id": 7,
      "title": "Witness the World's Largest Digital Camera: It's as Big as a Car! OR Eyes on Infinity",
      "image": "/camera.jpg",
      "category": "Technology",
      "author": "Pranita Kute",
      "authorPic": "author1.jpg",
      "published_date": "September 13, 2024",
      "reading_time": "10 minutes",
      "content1" : "The Legacy Survey of Space and Time (LSST) camera was meticulously and thoughtfully crafted with the explicit purpose of capturing revolutionary and unparalleled images of the vast expanse of outer space, showcasing the remarkable beauty and wonder that exists beyond our own planet. The LSST camera, which was designed with an incredible level of detail and care, was specifically created with the intention of capturing groundbreaking and unmatched photographs of the immense and boundless universe, thereby highlighting the extraordinary splendour and awe-inspiring phenomena that can be found far beyond the confines of our terrestrial home. The Legacy Survey of Space and Time (LSST) Camera will be mounted on the Simonyi Survey Telescope at the Vera C. Rubin Observatory in Chile later this year. According to the widely recognized authority of Guinness World Records, this remarkable piece of technology stands not only as the most massive digital camera in the world but also as a device of unparalleled resolution and clarity, pushing the boundaries of what is technologically possible in the realm of photography. ",
      "content2" :"As stated by the esteemed and widely acknowledged organisation known as Guinness World Records, this astonishing technological marvel is recognized not just as the largest digital camera currently in existence globally, but also as an exceptional instrument that boasts an unparalleled level of resolution and clarity, thereby stretching the limits of what can be achieved with modern technology in the fascinating field of photography. With the advent of this groundbreaking technology, the LSST Camera is poised to capture images of an astonishing number of galaxies that exceeds the total population of individuals inhabiting our planet Earth by a significant margin! Anticipating an extensive compilation of information encompassing approximately 37 billion astronomical entities, this remarkable endeavour will culminate in a comprehensive catalogue of data that is exponentially larger, by thousands of times, than any catalogue that has ever been created in the history of astronomical research. ",
      "content3" :"The newly developed imager has an impressive weight of 6,600 pounds, which is the equivalent of approximately 3,000 kilograms, and the lens itself stands at a remarkable height of 5 feet, or about 1.5 metres, making it roughly as tall as a small adult individual when measured across. The camera is equipped with an impressive array of three exceptionally large lenses, with the most prominent one towering at an astonishing height of over five feet, showcasing its remarkable engineering. In order to capture each photograph, these lenses will remain open for a precise duration of 15 seconds, allowing for the perfect exposure and clarity of the image. Following this process, the camera will seamlessly transition to the next image a mere five seconds later, ensuring a swift and efficient workflow. Capturing images at this rapid pace necessitates the use of equipment that is not only incredibly advanced but also exhibits an extraordinary level of precision in its functionality. There exists an additional lens that boasts a remarkable width of 90 centimetres, which is equivalent to approximately 3 feet, and this lens has been meticulously engineered with the specific purpose of effectively sealing the vacuum chamber that encases the camera's extraordinarily large focal plane. ",
      "content4" : "This focal plane, in turn, consists of a total of 201 individual, custom-designed CCD sensors that have been expertly crafted, and it is so incredibly flat that the variation in its surface does not exceed a mere tenth of the width of an average human hair, showcasing an impressive level of precision. Furthermore, the individual pixels themselves are astonishingly small, measuring only 0.01 mm in width, which translates to a minuscule size of 10 microns, highlighting the advanced technology employed in their design. With an astounding resolution of 3,200 megapixels, this advanced imaging technology significantly surpasses the capabilities of an ordinary digital camera currently available on the market, which typically offers a mere 48 megapixels. With dimensions remarkably akin to those of a compact car, the remarkable 3200MP camera is carefully designed to capture the stunning and awe-inspiring expanse of the universe in stunning detail. ",
      "content5": "Featuring a front lens of the highest quality that has been specifically optimised for the purpose of astronomical observations, this state-of-the-art camera is strategically positioned at the renowned Vera C. Observatory, where it stands poised and ready to unveil the celestial wonders that lie beyond the limits of our imagination. There are, in addition to the standard components, a total of six highly specialised filters that scientists have the capability to interchange in front of the camera lenses, thereby enhancing the versatility of their photographic equipment. Rather than simply altering the aesthetic of the images to appear nostalgic or glittery, these carefully designed filters provide scientists with the essential tools they need to conduct a thorough analysis of various wavelengths of light that are crucial for their research. The filters are specifically engineered to enable the camera to collect and record data on a range of light types, including but not limited to ultraviolet light, near-infrared light, and visible light, among other spectral categories. ",
      "content6" : "By utilising these diverse types of light, scientists are afforded the opportunity to gather and analyse a wide array of data, which can lead to significant advancements and discoveries in their respective fields of study.  After an extensive and thorough development period that spanned more than two decades, the dedicated scientists and engineers at the SLAC National Accelerator Laboratory, which is part of the US Department of Energy, have successfully finalised the construction of the groundbreaking LSST Camera. This remarkable milestone signifies the creation of the largest digital camera ever designed and built specifically for the exploration of astronomical phenomena, showcasing dimensions that are indeed comparable to those of a compact automobile and an impressive overall weight that approaches 3,000 kilograms.",
      "content7": "Concentrating on the state-of-the-art LSST Camera, the Rubin Observatory is prepared to commence an extraordinary voyage into the profound realms of the universe, seeking to reveal solutions to several of the most intricate and fundamentally essential questions that currently face the domain of physics, stated Kathy Turner, who acts as the program manager for the Department of Energy’s Cosmic Frontier Program. The LSST Camera has been meticulously engineered to gather an immense quantity of data concerning the various celestial phenomena that unfold in the expansive night sky of the southern hemisphere, thereby allowing for comprehensive analysis and understanding. Researchers are able to harness this colossal dataset in their quest to unveil novel insights pertaining to the enigmatic concepts of dark energy and dark matter, the ever-changing characteristics of the night sky, the intricate structure of the Milky Way galaxy, as well as the dynamics of our very own solar system.",
      "content8": "Scientists assert that the most astonishing feature of this cutting-edge camera is its extraordinary ability to capture intricate details with remarkable precision across an unmatched and vast area of the celestial sphere, which is truly a testament to its sophisticated design. The sheer scale of this capability is so profound that it would require the deployment of hundreds of ultra-high-definition televisions to properly display even a single one of the stunning images produced by this revolutionary technological advancement in astronomical observation. “Its images are so detailed that it could resolve a golf ball from around [15 miles (25 kilometres)] away, while covering a swath of the sky seven times wider than the full Moon,” said Rubin Observatory Deputy Director and Camera Program Lead Aaron Roodman. This camera will open our eyes to a larger view of the universe than we’ve ever had before.",
              
      "tags": [
          "tech"
      ]     
  }
]
}